# tried with a small data example to sort out the loop in my mind

In [1]:
import pandas as pd

# Create a sample DataFrame
df = pd.DataFrame({'col1': ['a', 'b', 'c'], 'col2': [1, 2, 3], 'col3': [4, 5, 6]})

df.head()

  col1  col2  col3
0    a     1     4
1    b     2     5
2    c     3     6

In [2]:
df

  col1  col2  col3
0    a     1     4
1    b     2     5
2    c     3     6

In [3]:
# Select only the numerical columns
num_cols = df.select_dtypes(include='number').columns

# Loop through the numerical columns and apply a formula
for col in num_cols:
    df[[col]] = df[[col]] * 2

print(df)

  col1  col2  col3
0    a     2     8
1    b     4    10
2    c     6    12

# faulty first attempt

In [4]:
df1=pd.read_csv('supershops.csv')

In [5]:
df1.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [6]:
df1.shape

(50, 5)

In [7]:
x=df1.drop('Profit', axis= 1)
y= df1[['Profit']]

In [8]:
x2=x.copy()

In [9]:
x3=x.copy()

In [10]:
x4=x.copy()

In [11]:
x5=x.copy()

In [12]:
from sklearn.preprocessing import MinMaxScaler
m = MinMaxScaler()

In [13]:
number_cols= df1.select_dtypes(include='number').columns

In [14]:
for cols1 in number_cols:   #but here is a simple mistake. normalize can only be done on features not predicted outputs. that's why we have to assume profit as y and other parameters as x. so, we have to normalize only x values. not y.
    df1[[cols1]]=m.fit_transform(df1[[cols1]])
df1.head()

   Marketing Spend  Administration  Transport     Area    Profit
0         0.692617        0.651744   1.000000    Dhaka  1.000000
1         0.983359        0.761972   0.940893      Ctg  0.997355
2         0.927985        0.379579   0.864664  Rangpur  0.993178
3         0.873136        0.512998   0.812235    Dhaka  0.947292
4         0.859438        0.305328   0.776136  Rangpur  0.853171

In [15]:
#after correcting our first attempt, this is the right code

# Normalization

In [16]:
number_cols1= x.select_dtypes(include='number').columns
for cols2 in number_cols1:    
    x[[cols2]]=m.fit_transform(x[[cols2]])
x.head()

   Marketing Spend  Administration  Transport     Area
0         0.692617        0.651744   1.000000    Dhaka
1         0.983359        0.761972   0.940893      Ctg
2         0.927985        0.379579   0.864664  Rangpur
3         0.873136        0.512998   0.812235    Dhaka
4         0.859438        0.305328   0.776136  Rangpur

# Standard Scaler

In [17]:
from sklearn.preprocessing import StandardScaler
s= StandardScaler()

In [18]:
number_cols2= x2.select_dtypes(include='number').columns
for cols3 in number_cols2:    
    x2[[cols3]]=s.fit_transform(x2[[cols3]])
x2.head()

   Marketing Spend  Administration  Transport     Area
0         0.897913        0.560753   2.165287    Dhaka
1         1.955860        1.082807   1.929843      Ctg
2         1.754364       -0.728257   1.626191  Rangpur
3         1.554784       -0.096365   1.417348    Dhaka
4         1.504937       -1.079919   1.273550  Rangpur

# max abs scaler

In [19]:
from sklearn.preprocessing import MaxAbsScaler
m_abs= MaxAbsScaler()
number_cols3= x3.select_dtypes(include='number').columns
for cols4 in number_cols3:    
    x3[[cols4]]=m_abs.fit_transform(x3[[cols4]])
x3.head()

   Marketing Spend  Administration  Transport     Area
0         0.692617        0.749527   1.000000    Dhaka
1         0.983359        0.828805   0.940893      Ctg
2         0.927985        0.553781   0.864664  Rangpur
3         0.873136        0.649738   0.812235    Dhaka
4         0.859438        0.500378   0.776136  Rangpur

# Robust Scaler

In [20]:
from sklearn.preprocessing import RobustScaler
r= RobustScaler()
number_cols4= x4.select_dtypes(include='number').columns
for cols5 in number_cols4:    
    x4[[cols5]]=r.fit_transform(x4[[cols5]])
x4.head()

   Marketing Spend  Administration  Transport     Area
0         0.672530        0.345355   1.552016    Dhaka
1         1.452113        0.697565   1.383714      Ctg
2         1.303634       -0.524290   1.166654  Rangpur
3         1.156567       -0.097977   1.017368    Dhaka
4         1.119836       -0.761543   0.914576  Rangpur